benchmark/results/qwen_nautilus_small_load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 128 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 128 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 128 VUs  0m01.0s/1m0s

running (0m02.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 128 VUs  0m02.0s/1m0s

running (0m03.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 128 VUs  0m03.0s/1m0s

running (0m04.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 128 VUs  0m04.0s/1m0s

running (0m05.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 128 VUs  0m05.0s/1m0s

running (0m06.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 128 VUs  0m06.0s/1m0s

running (0m07.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 128 VUs  0m07.0s/1m0s

running (0m08.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 128 VUs  0m08.0s/1m0s

running (0m09.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 128 VUs  0m09.0s/1m0s

running (0m10.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 128 VUs  0m10.0s/1m0s

running (0m11.0s), 128/128 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 128 VUs  0m11.0s/1m0s

running (0m12.0s), 128/128 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 128 VUs  0m12.0s/1m0s

running (0m13.0s), 128/128 VUs, 25 complete and 0 interrupted iterations
default   [  22% ] 128 VUs  0m13.0s/1m0s

running (0m14.0s), 128/128 VUs, 25 complete and 0 interrupted iterations
default   [  23% ] 128 VUs  0m14.0s/1m0s

running (0m15.0s), 128/128 VUs, 25 complete and 0 interrupted iterations
default   [  25% ] 128 VUs  0m15.0s/1m0s

running (0m16.0s), 128/128 VUs, 25 complete and 0 interrupted iterations
default   [  27% ] 128 VUs  0m16.0s/1m0s

running (0m17.0s), 128/128 VUs, 25 complete and 0 interrupted iterations
default   [  28% ] 128 VUs  0m17.0s/1m0s

running (0m18.0s), 128/128 VUs, 38 complete and 0 interrupted iterations
default   [  30% ] 128 VUs  0m18.0s/1m0s

running (0m19.0s), 128/128 VUs, 38 complete and 0 interrupted iterations
default   [  32% ] 128 VUs  0m19.0s/1m0s

running (0m20.0s), 128/128 VUs, 38 complete and 0 interrupted iterations
default   [  33% ] 128 VUs  0m20.0s/1m0s

running (0m21.0s), 128/128 VUs, 44 complete and 0 interrupted iterations
default   [  35% ] 128 VUs  0m21.0s/1m0s

running (0m22.0s), 128/128 VUs, 44 complete and 0 interrupted iterations
default   [  37% ] 128 VUs  0m22.0s/1m0s

running (0m23.0s), 128/128 VUs, 47 complete and 0 interrupted iterations
default   [  38% ] 128 VUs  0m23.0s/1m0s

running (0m24.0s), 128/128 VUs, 51 complete and 0 interrupted iterations
default   [  40% ] 128 VUs  0m24.0s/1m0s

running (0m25.0s), 128/128 VUs, 53 complete and 0 interrupted iterations
default   [  42% ] 128 VUs  0m25.0s/1m0s

running (0m26.0s), 128/128 VUs, 55 complete and 0 interrupted iterations
default   [  43% ] 128 VUs  0m26.0s/1m0s

running (0m27.0s), 128/128 VUs, 68 complete and 0 interrupted iterations
default   [  45% ] 128 VUs  0m27.0s/1m0s

running (0m28.0s), 128/128 VUs, 71 complete and 0 interrupted iterations
default   [  47% ] 128 VUs  0m28.0s/1m0s

running (0m29.0s), 128/128 VUs, 74 complete and 0 interrupted iterations
default   [  48% ] 128 VUs  0m29.0s/1m0s

running (0m30.0s), 128/128 VUs, 77 complete and 0 interrupted iterations
default   [  50% ] 128 VUs  0m30.0s/1m0s

running (0m31.0s), 128/128 VUs, 78 complete and 0 interrupted iterations
default   [  52% ] 128 VUs  0m31.0s/1m0s

running (0m32.0s), 128/128 VUs, 80 complete and 0 interrupted iterations
default   [  53% ] 128 VUs  0m32.0s/1m0s

running (0m33.0s), 128/128 VUs, 82 complete and 0 interrupted iterations
default   [  55% ] 128 VUs  0m33.0s/1m0s

running (0m34.0s), 128/128 VUs, 85 complete and 0 interrupted iterations
default   [  57% ] 128 VUs  0m34.0s/1m0s

running (0m35.0s), 128/128 VUs, 87 complete and 0 interrupted iterations
default   [  58% ] 128 VUs  0m35.0s/1m0s

running (0m36.0s), 128/128 VUs, 95 complete and 0 interrupted iterations
default   [  60% ] 128 VUs  0m36.0s/1m0s

running (0m37.0s), 128/128 VUs, 97 complete and 0 interrupted iterations
default   [  62% ] 128 VUs  0m37.0s/1m0s

running (0m38.0s), 128/128 VUs, 98 complete and 0 interrupted iterations
default   [  63% ] 128 VUs  0m38.0s/1m0s

running (0m39.0s), 128/128 VUs, 101 complete and 0 interrupted iterations
default   [  65% ] 128 VUs  0m39.0s/1m0s

running (0m40.0s), 128/128 VUs, 103 complete and 0 interrupted iterations
default   [  67% ] 128 VUs  0m40.0s/1m0s

running (0m41.0s), 128/128 VUs, 105 complete and 0 interrupted iterations
default   [  68% ] 128 VUs  0m41.0s/1m0s

running (0m42.0s), 128/128 VUs, 110 complete and 0 interrupted iterations
default   [  70% ] 128 VUs  0m42.0s/1m0s

running (0m43.0s), 128/128 VUs, 113 complete and 0 interrupted iterations
default   [  72% ] 128 VUs  0m43.0s/1m0s

running (0m44.0s), 128/128 VUs, 113 complete and 0 interrupted iterations
default   [  73% ] 128 VUs  0m44.0s/1m0s

running (0m45.0s), 128/128 VUs, 118 complete and 0 interrupted iterations
default   [  75% ] 128 VUs  0m45.0s/1m0s

running (0m46.0s), 128/128 VUs, 118 complete and 0 interrupted iterations
default   [  77% ] 128 VUs  0m46.0s/1m0s

running (0m47.0s), 128/128 VUs, 123 complete and 0 interrupted iterations
default   [  78% ] 128 VUs  0m47.0s/1m0s

running (0m48.0s), 128/128 VUs, 125 complete and 0 interrupted iterations
default   [  80% ] 128 VUs  0m48.0s/1m0s

running (0m49.0s), 128/128 VUs, 131 complete and 0 interrupted iterations
default   [  82% ] 128 VUs  0m49.0s/1m0s

running (0m50.0s), 128/128 VUs, 132 complete and 0 interrupted iterations
default   [  83% ] 128 VUs  0m50.0s/1m0s

running (0m51.0s), 128/128 VUs, 172 complete and 0 interrupted iterations
default   [  85% ] 128 VUs  0m51.0s/1m0s

running (0m52.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  87% ] 128 VUs  0m52.0s/1m0s

running (0m53.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  88% ] 128 VUs  0m53.0s/1m0s

running (0m54.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  90% ] 128 VUs  0m54.0s/1m0s

running (0m55.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  92% ] 128 VUs  0m55.0s/1m0s

running (0m56.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  93% ] 128 VUs  0m56.0s/1m0s

running (0m57.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  95% ] 128 VUs  0m57.0s/1m0s

running (0m58.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  97% ] 128 VUs  0m58.0s/1m0s

running (0m59.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [  98% ] 128 VUs  0m59.0s/1m0s

running (1m00.0s), 128/128 VUs, 175 complete and 0 interrupted iterations
default   [ 100% ] 128 VUs  1m00.0s/1m0s

running (1m01.0s), 125/128 VUs, 178 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m02.0s), 123/128 VUs, 180 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m03.0s), 116/128 VUs, 187 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m04.0s), 116/128 VUs, 187 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m05.0s), 116/128 VUs, 187 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m06.0s), 116/128 VUs, 187 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m07.0s), 116/128 VUs, 187 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m08.0s), 109/128 VUs, 194 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m09.0s), 106/128 VUs, 197 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m10.0s), 105/128 VUs, 198 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m11.0s), 058/128 VUs, 245 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m12.0s), 056/128 VUs, 247 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m13.0s), 053/128 VUs, 250 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m14.0s), 049/128 VUs, 254 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m15.0s), 046/128 VUs, 257 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m16.0s), 044/128 VUs, 259 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m17.0s), 034/128 VUs, 269 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m18.0s), 030/128 VUs, 273 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m19.0s), 026/128 VUs, 277 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m20.0s), 023/128 VUs, 280 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m21.0s), 020/128 VUs, 283 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m22.0s), 017/128 VUs, 286 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m23.0s), 015/128 VUs, 288 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m24.0s), 010/128 VUs, 293 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m25.0s), 008/128 VUs, 295 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m26.0s), 006/128 VUs, 297 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m27.0s), 004/128 VUs, 299 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s

running (1m28.0s), 001/128 VUs, 302 complete and 0 interrupted iterations
default ↓ [ 100% ] 128 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=30.81s min=11.67s med=26.52s max=50.27s p(90)=50.11s p(95)=50.19s
      { expected_response:true }...: avg=24.35s min=11.67s med=23.03s max=49.63s p(90)=35.08s p(95)=41.36s
    http_req_failed................: 25.08% 76 out of 303
    http_reqs......................: 303    3.437994/s

    EXECUTION
    iteration_duration.............: avg=31s    min=11.92s med=26.63s max=50.53s p(90)=50.49s p(95)=50.5s 
    iterations.....................: 303    3.437994/s
    vus............................: 1      min=1         max=128
    vus_max........................: 128    min=128       max=128

    NETWORK
    data_received..................: 554 kB 6.3 kB/s
    data_sent......................: 279 kB 3.2 kB/s



running (1m28.1s), 000/128 VUs, 303 complete and 0 interrupted iterations
default ✓ [ 100% ] 128 VUs  1m0s